#1回目の試行
v=0
z=100

#2~322回の試行
#重力加速度は、国際度量衡総会における標準加速度を用いる。
for (t in 2:322) {
    v = v - (9.80665 -v^2) *0.1 #(2)の式
    z = z + v*0.1 #(1)の式
    print(z)
}

#結果
[1] 99.90193
[1] 99.71542
[1] 99.46562
...
[1] 0.8672443
[1] 0.5540886
[1] 0.2409329
[1] -0.07222281
Finish


#1回目の試行
v=0
z=100

#2~3216回の試行
#重力加速度は、国際度量衡総会における標準加速度を用いる。
for (t in 2:3216) {
    v = v - (9.80665 -v^2) *0.01 #(2)の式
    z = z + v*0.01 #(1)の式
    print(z)
}

結果
[1] 99.99902
[1] 99.99706
[1] 99.99412
...
[1] 0.08236598
[1] 0.05105041
[1] 0.01973484
[1] -0.01158073
Finish









t =1:32160
t_length = length(t)
print(t_length)

log(真数, 底)

A = 1/sqrt(9.80665) * log(exp(1)^100 + sqrt(exp(1)^200 - 1), exp(1))